import React, { Component } from 'react';
import {
  Container, Content, Text
} from 'native-base';

export default class TermScreen extends Component {
  constructor(props) {
    super(props);
  }

  render() {
    return (
      <Container>
        <Content>
          <Text>
            개인정보의 수집 및 이용 목적          {'\n'}
            톡톡톡(talx3) 서비스 (이하 ‘서비스’)는 다음의 목적을 위하여 개인정보를 처리하고 있으며, 다음의 목적 이외의 용도로는 이용하지 않습니다.
            {'\n'}
            {'\n'}
            회사는 원활한 서비스를 제공하여 더욱 향상된 고객 경험을 드리기 위해 필요한 고객의 개인정보를 수입 또는 이용합니다.
            고객이 동의한 이용약관에 따라 서비스의 기본 기능이나 여러 특화된 기능을 제공하기 위해서 고객의 이메일, 출생년도, 성별, 사용기기 등의 확인이 필요한 경우가 있습니다.
            또한 고객이 개인정보를 고객에게 개별적으로 알려 드릴 사항이 있을 때나 서비스 이용과 관련하여 문의나 분쟁이 있을 경우, 유료 서비스 이용시 하트의 구입 및 요금 결제를 위해서도 필요합니다.
            그 외에도 새로운 서비스 개발 및 기능 개선, 맞춤형 서비스 제공 및 광고 게재, 각종 이벤트 및 광고성 정보의 제공 및 참여 기회 제공, 법령 등에 규정된 의무와 이행 법령이나 이용약관에 반하여 고객에게 피해를 줄 수 있는 잘못된 이용행위를 방지 및 차단 등을 위해서도 여러분의 개인정보가 필요합니다.
 {'\n'}
            {'\n'}
            ο 본 방침은 2019년 08월 05일부터 시행됩니다 {'\n'}
            수집하는 개인정보 항목 {'\n'}
            회사가 보다 나은 서비스를 제공하기 위해서 수집하는 고객의 개인정보는 다음과 같습니다.
            처음 회원가입할 때 또는 서비스를 이용하는 과정에서 회원의 이메일 주소, 비밀번호, 해당 계정의 공개 프로필, 출생년도, 성별, 사진, 서비스 이용과정이나 사업처리 과정에서 단말기 정보(OS, 화면 크기, 다바이스 아이디), IP정보, 쿠키 정보가 자동으로 생성되어 수집됩니다.
            위에서 언급된 개인정보는 고객이 회원가입을 하거나 서비스를 이용하는 과정에서 직접 제공하거나 자동화된 시스템을 통해서 수집됩니다. 회사는 수집하는 개인정보에 대하여 여러분의 동의를 받고 서비스를 제공하게 됩니다.
   {'\n'}
            {'\n'}
            개인정보의 보유 및 이용기간, 파기  {'\n'}
            회원이 가입한 날부터 서비스를 제공하는 기간 동안에만 이용자의 개인정보를 보유합니다.
            개인정보의 수집 및 이용 동의를 철회할 경우 또는 수집 및 이용 목적이 달성되거나 보유 및 이용 기간이 종료 한 경우 개인정보를 지체 없이 파기합니다.
            이 경우 개인정보는 어떠한 용도로도 열람 또는 이용할 수 없도록 처리됩니다.
            이용자의 개인정보는 회원가입 해지 시 또는 제공 목적 달성 후 별도의 DB로 옮겨져 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 보관된 후 기록을 재생할 수 없는 기술적 방법에 의하여 영구 삭제됩니다.
            별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유 이외의 다른 목적으로 이용되지 않습니다.
            서비스 이용 기록, 접속 로그, 접속 IP 정보 : 3 개월 (통신 비밀 보호법) 표시 / 광고에 관한 기록 : 6 개월 (전자 상거래 등에서의 소비자 보호에 관한 법률) 계약 또는 청약 철회 등에 관한 기록 : 5 년 (전자 상거래 등에서의 소비자 보호에 관한 법률) 대금 결제 및 재화 등의 공급에 관한 기록 : 5 년 (전자 상거래 등에서의 소비자 보호에 관한 법률) 소비자의 불만 또는 분쟁 처리에 관한 기록 : 3 년 (전자 상거래 등에서의 소비자 보호에 관한 법률) 다만 서비스의 부정한 이용으로 인한 분쟁을 방지하기 위한 내부방침에 따라 서비스의 부정 이용 기록은 3년간 보존한 다음 파기됩니다.
   {'\n'}
            {'\n'}
            개인정보 제3자 제공 및 위탁
            고객이 서비스 이용과정 등에서 따로 동의하는 경우나 법령에 규정된 경우를 제외하고는 고객의 개인 정보를 위에서 말씀드린 목적 범위를 초과하여 이용하거나 제3자에게 제공 또는 공유하지 않습니다. 하지만 서비스 향상, 법령이나 이용 약관에 반하여 다른 고객에게 피해를 줄 수 있는 잘못된 이용행위의 차단, 방지 및 안정적인 개인정보 취급을 위해서 고객의 개인정보를 외부에 위탁하여 처리할 수 있습니다. 위탁처리 기관 및 위탁업무의 내용은 아래를 참조해 주세요.
 {'\n'}
            {'\n'}
            수탁업체 : Amazon Web Services, Inc.{'\n'}
            위탁 내용 : 계정 정보 서버 저장{'\n'}
            개인정보의 보유 및 이용기간: 회원탈퇴 시 혹은 위탁계약 종료 시까지
            개인정보의 암호화 및 해킹 등에 대한 기술적 대책
            이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.
{'\n'}
            “서비스”는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신•점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.
  {'\n'}
            {'\n'}
            이용자의 권리{'\n'}
            이용자는 언제든지 등록되어있는 비밀번호 등의 정보를 서비스 내 설정 메뉴에서 확인, 정정 할 수 있습니다. 또한 계정을 탈퇴할 수 있으며 서비스 내에 해당 조치가 원활하지 않을 경우에는 고객센터에 요청하시면 신속히 처리하겠습니다.
  {'\n'}
            {'\n'}
            개인정보 보호책임자{'\n'}
            회사는 개인 정보 처리에 관한 업무를 총괄해서 책임지고, 개인 정보 처리와 관련한 정보주체의 불만처리 및 피해 구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
{'\n'}
            {'\n'}
            ο 개인정보 보호책임자{'\n'}
            이름 : 김준영{'\n'}
            직위 : 대표이사{'\n'}
            연락처 : help@indeefun.com{'\n'}

          </Text>
        </Content>
      </Container>
    );
  }
}

TermScreen.navigationOptions = {
  // title: 'Setting',
};